package com.chinafocus.bookshelf.model.bean;

public class BookContentRawBean {

    /**
     * code : 200
     * data : {"next":"Chapter2.xhtml","current":"<!--?xml version=\"1.0\" encoding=\"utf-8\" ?--><!DOCTYPE html PUBLIC \" -//W3C//DTD XHTML 1.1//EN\" \"http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd\"><html xmlns=\"http://www.w3.org/1999/xhtml\" xml:lang=\"zh-CN\"> <head>   <link href=\"img/stylesheet.img\" type=\"text/img\" rel=\"stylesheet\">   <title>吕氏春秋卷一 孟春纪<\/title>  <\/head>     <h1 class=\"chapterCaption\"><a id=\"ebookNote_1\"><\/a>吕氏春秋卷一 孟春纪<\/h1>   <h2 class=\"sectionHeading\"><a id=\"ebookNote_2\"><\/a>孟春纪<\/h2>   <p class=\"bodyReference\">一曰\u2014\u2014<\/p>   <p class=\"bodyContent\">孟春之月：日在营室，昏参中，旦尾中。其日甲乙。其帝太暤。其神句芒。其虫鳞。其音角。律中太簇。其数八。其味酸。其臭进。其祀户。祭先脾。东风解冻。蛰虫始报。鱼上冰。獭祭鱼。候雁北。天子居青阳左个，乘鸾[车各]，驾苍龙，载青旗，衣青衣，服青玉，食麦与羊。其器疏以达。<\/p>   <p class=\"bodyContent\">是月也，以立春。先立春三日，太史谒之天子日 ：\u2018某日立春，盛德在木 。\u201d天子乃斋。立春之日，天子亲率三公九卿诸俟大夫以迎春于东郊。还，乃赏公卿诸侯大夫于朝。命相布德和令，行庆施惠，下及兆民。庆赐遂行，无有不当。乃俞太史，守典奉法，司天日月星辰之行，宿离不忒，无失经纪，以初为常。<\/p>   <p class=\"bodyContent\">是月也，天子乃以元日祈谷于上帝。乃择元辰，天子亲载耒耜，措之参于保、介、御之间，率三公九卿诸侯大夫躬耕帝籍田，天子三 ，（三）公五推，卿诸侯大夫九推。反，执爵于太寝，三公九卿诸侯大夫告御，命日\u201c劳酒 \u201d。是月也，大气下降，地气上腾，天地和同，草木繁动。王布衣事：命田舍东郊，皆修封疆，审端径术，善相丘陵孤险原隰，土地质宜，五谷所殖，以教道民，必躬亲之。田事既饬，先定准直，农乃不惑。<\/p>   <p class=\"bodyContent\">是月也，命乐正入学习舞，乃修祭典，命把山林川泽，牺牲无用牝。禁止伐木，无覆巢，无杀孩虫胎夭飞鸟，无鴽无卵，无聚大众，无置城郭，掩骼霾[骨差]。<\/p>   <p class=\"bodyContent\">是月也，不可以称兵，称兵必有天殃。兵戎不起，不可以从我始。无变天之道，无绝地之理，无乱人之纪。<\/p>   <p class=\"bodyContent\">孟春行夏令，则风雨不时，草木早槁，国乃有恐。行秋令，则民大疫，疾风暴雨数至，藜莠蓬蒿并兴。行冬令，则水潦为败，霜雪大挚，首种不入。<\/p>   <h2 class=\"sectionHeading\"><a id=\"ebookNote_3\"><\/a>本生<\/h2>   <p class=\"bodyReference\">二曰\u2014\u2014<\/p>   <p class=\"bodyContent\">始生之者，天也；养成之者，人也。能养天之所生而勿撄之谓天子。天子之动也，以全天为故者也。此官之所自立也。立官者以全生也。今世之感主，多官而反以害生，则失所为立之矣。臂之若修兵者，以备寇也，分修兵而反以自攻，则亦失所为修之矣。<\/p>   <p class=\"bodyContent\">夫水之性情，土者鴽之，故不得清。人之性寿，物者鴽之，故不得寿。物也者，所以养性也，非（所）以性养也。今世之人，惑者多以性养物，则不知轻重也。不知轻重，则重者为轻，轻者为重矣。若此，则每动无不败，以此为君悖，以此为臣乱，以此为子狂。三者国有一焉，无幸必亡。<\/p>   <p class=\"bodyContent\">今有声于此，耳听之必慊，已听之则使人聋，必弗听。有色于此，目视之必慊，已视之则使人盲，必弗视。有味于此，口食之必慊，已食之则使人瘩，必弗食。是教圣人之子声色滋味也，利于性则取之，害于性则舍之，此全性之道也。世之贵富者，其子声色滋味也多惑者，日夜求，幸而得之则遁焉。遁焉，性�= \"bodyContent\">万人操弓共射一招，招无不中。万物章章，以害一生，生无不伤；以便一生，生无不长。故圣人之制万物也，以全其天也。天全则神和矣，目明矣，耳听矣，鼻臭矣，口敏矣，三百六十节皆通利矣。若此人者，不言而信，不谋而当，不虑而得；精通乎天地，神覆乎宇宙；其于物无不受也，无不裹也，若天地然；上为天子而不骄，下为匹夫而不惛；此之谓全德之人。<\/p>   <p class=\"bodyContent\">贵富而不知道，适足以为患，不如贫贱。贫贱之致物也难，虽欲过之奚由？出则以车，入则以辇，务以自佚，命之曰招鴽之机。肥肉厚酒，务以自强，命之日烂肠之食。靡曼皓齿，郑、卫之音，务以自乐，命之日伐性之斧。三患者，贵富之所致也。故古之人有不肯富者矣，由重生故也，非夸以名也，为其实也。则此论之不可不察也。<\/p>   <h2 class=\"sectionHeading\"><a id=\"ebookNote_4\"><\/a>重已<\/h2>   <p class=\"bodyReference\">三曰\u2014\u2014<\/p>   <p class=\"bodyContent\">倕，至巧也。人不爱倕之指，而爱己之指，有之利故也。人不爱昆山之玉，江汉之珠，而爱己一苍壁小玑，有之利故也。今吾生之为我有，而利我亦大矣。论其贵贱，爵为天子，不足以比焉；论其轻重，富有天下，不可以易之；论其安危，一曙失之，终身不复得。此三者，有道者之所慎也。有慎之而反害之者，不达乎性命之情也。不达平性命之情，慎之何益？是师者之爱子也。不免乎枕之以糠；是聋者之养婴儿也，方雷而窥之于堂；有殊弗知慎者。夫弗知慎者，是死生存亡可不可，未始有别也。未始有别者，其所谓是未尝是，其所谓非未尝非，是其所谓非，非其所谓是，此之谓大惑。若此人者，天之所祸也。以此治身，必死必殃；以此治国，必残必亡。夫死殃残亡，非自至也，感召之也。寿长至常亦然。故有道者，不察所召，而察其召之者，则其至不可禁矣。此论不可不熟。<\/p>   <p class=\"bodyContent\">使乌获疾引牛尾，尾绝力殚，而牛不可行， 逆也。 使五尺竖子引其棬，而牛恣所以之，顺也。世之人主贵人，无贤不肖，莫不欲长生久视，而目逆其生，欲之何益？凡生之长也，顺之也；使生不顾者，欲也；教圣人必先适欲。<\/p>   <p class=\"bodyContent\">室大则多阴，台高则多阳，多阴则蹶，多阳则痿，此阴阳不适之患也。是故先王不处大室，不为高台，味不众珍，衣不燀热。燀热则理塞，理塞则气不达；味众珍则胃充，胃充则中大鞔；中大鞔而气不达，以此长生，可得乎？昔先圣王之为苑囿国池也，足以观望劳形而已矣；其为宫室台榭也，足以辟燥湿而已矣；其为奥马衣裘也，足以逸身暖骸而已矣；其为饮食酏醴也，足以适味充虚而已矣；其为声色音乐也，足以实性自娱而已矣。五者，圣王之所以养性也，非好俭而恶费也，节乎性也。<\/p>   <h2 class=\"sectionHeading\"><a id=\"ebookNote_5\"><\/a>贵公<\/h2>   <p class=\"bodyReference\">四曰\u2014\u2014<\/p>   <p class=\"bodyContent\">昔先圣王之治天下也，必先公，公则天下平矣。平得于公。尝试观于上志，有得天下者众矣，其得之〔必〕以公，其失之必以偏。（凡主之立生于公）故《鸿范 》曰：\u201c无偏无党， 王道荡荡；无偏无颇，遵王之义；无或作好，遵王之道；无或作恶，遵王之路 。\u201d<\/p>   <p class=\"bodyContent\">天下非一人之天下也，天下之天下也。阴阳之和，不长一类；甘露时雨，不私一物；万民之主，不阿一人。伯禽将行，请所以治鲁，周公日：\u201c利而勿利也 。\u201d刑人有遗弓者， 而不肯索，曰：\u201c荆人遗之，荆人得之，又何索焉？\u201d 孔子闻之曰：\u201c去其\u2018荆\u2019而可矣 。�大官也。 处大官者， 不欲小察， 不欲小智， 放曰： 大匠不鴽， 大庖不豆， 大勇不斗， 大兵不寇。 桓公行公去私恶， 用管子而为五伯长， 行私阿所爱， 用竖刀而虫出于户。 < /p>   <p class=\"bodyContent\">人之少也愚，其长也智，故智而用私，不若愚而用公。日醉而饰服，私利而立公，贪戾而求王，舜弗能为。<\/p > < h2 class = \"sectionHeading\"><a id=\"ebookNote_6\"><\/a>去私<\/h2>   <p class=\"bodyReference\">五曰\u2014\u2014<\/p>   <p class=\"bodyContent\">天无私覆也，地无私载也，日月无私烛也，四时无私行也，行其德而万物得遂长焉。<\/p>   <p class=\"bodyContent\">黄帝言目 ：\u2018声禁重，色禁重，农禁重，香禁重，味禁重，室禁重 。\u201d<\/p>   <p class=\"bodyContent\">\u201c尧有子十八，不与其子而授舜，舜有子九人，不与其子而授禹，至公也。<\/p>   <p class=\"bodyContent\">晋平公问于祁黄羊口 ：\u2018南阳无令，其谁可而为之？\u201d祁黄羊对曰；\u201c解狐可 。\u201d平公曰 ：\u2018解狐非子之仇邪？\u201d对曰：\u201c君问可，非问臣之仇也 。\u201d平公曰：\u201c善 。\u201d遂用之。 国人称善焉。居有间， 平公又问祁黄羊口 ：\u2018国无尉， 其谁可而为之？\u201d对日 ：\u2018午可 。\u201d平公曰 ：\u2018午非子之子邪？\u201d对曰：\u2018君问可，非问臣之子也 。\u201d平公曰：\u201c善 。\u201d又遂用之。 国人称善焉。孔子闻之曰：\u201c善哉！祁黄羊之论也，外举不避仇，内举不避子 。\u201d祁黄羊可谓公矣。<\/p>   <p class=\"bodyContent\">墨者有巨子腹[黄享]，居秦，其子杀人， 秦惠王曰：\u201c先生之年长矣，非有它子也，寡人已令吏弗诛矣，先生之以此听寡人也 。\u201d腹[黄享]对曰；\u2018墨者之法日 ：\u2018杀人者死， 伤人者刑\u2019，此所以禁杀伤人也。夫禁杀伤人者， 天下之大义也，王虽为之赐，而令吏弗诛，腹[黄享]不可不行墨者之法 。\u201d不许惠王，而遂杀之。子，人之所私也，忍所私以行大义，巨子可谓公矣。<\/p>   <p class=\"bodyContent\">庖人调和而弗敢食，故可以为庖。若使底子调和而食之，则不可以为疱矣。王伯之君亦然，诛暴而不私，以封天下之贤者，故可以为王伯；若使王伯之君诛暴而私之，则亦不可为王伯矣。<\/p>    <\/html>","img":"https://bookcases.oss-cn-beijing.aliyuncs.com/6a35c613bb6cba0df788edd90c88ed19/css/Stylesheet.css"}
     * msg : success
     */

    private int code;
    private BookContentResultBean data;
    private String msg;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public BookContentResultBean getData() {
        return data;
    }

    public void setData(BookContentResultBean data) {
        this.data = data;
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public static class BookContentResultBean {
        /**
         * next : Chapter2.xhtml
         * current : <!--?xml version="1.0" encoding="utf-8" ?--><!DOCTYPE html PUBLIC " -//W3C//DTD XHTML 1.1//EN" "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd"><html xmlns="http://www.w3.org/1999/xhtml" xml:lang="zh-CN"> <head>   <link href="img/stylesheet.img" type="text/img" rel="stylesheet">   <title>吕氏春秋卷一 孟春纪</title>  </head>     <h1 class="chapterCaption"><a id="ebookNote_1"></a>吕氏春秋卷一 孟春纪</h1>   <h2 class="sectionHeading"><a id="ebookNote_2"></a>孟春纪</h2>   <p class="bodyReference">一曰——</p>   <p class="bodyContent">孟春之月：日在营室，昏参中，旦尾中。其日甲乙。其帝太暤。其神句芒。其虫鳞。其音角。律中太簇。其数八。其味酸。其臭进。其祀户。祭先脾。东风解冻。蛰虫始报。鱼上冰。獭祭鱼。候雁北。天子居青阳左个，乘鸾[车各]，驾苍龙，载青旗，衣青衣，服青玉，食麦与羊。其器疏以达。</p>   <p class="bodyContent">是月也，以立春。先立春三日，太史谒之天子日 ：‘某日立春，盛德在木 。”天子乃斋。立春之日，天子亲率三公九卿诸俟大夫以迎春于东郊。还，乃赏公卿诸侯大夫于朝。命相布德和令，行庆施惠，下及兆民。庆赐遂行，无有不当。乃俞太史，守典奉法，司天日月星辰之行，宿离不忒，无失经纪，以初为常。</p>   <p class="bodyContent">是月也，天子乃以元日祈谷于上帝。乃择元辰，天子亲载耒耜，措之参于保、介、御之间，率三公九卿诸侯大夫躬耕帝籍田，天子三 ，（三）公五推，卿诸侯大夫九推。反，执爵于太寝，三公九卿诸侯大夫告御，命日“劳酒 ”。是月也，大气下降，地气上腾，天地和同，草木繁动。王布衣事：命田舍东郊，皆修封疆，审端径术，善相丘陵孤险原隰，土地质宜，五谷所殖，以教道民，必躬亲之。田事既饬，先定准直，农乃不惑。</p>   <p class="bodyContent">是月也，命乐正入学习舞，乃修祭典，命把山林川泽，牺牲无用牝。禁止伐木，无覆巢，无杀孩虫胎夭飞鸟，无鴽无卵，无聚大众，无置城郭，掩骼霾[骨差]。</p>   <p class="bodyContent">是月也，不可以称兵，称兵必有天殃。兵戎不起，不可以从我始。无变天之道，无绝地之理，无乱人之纪。</p>   <p class="bodyContent">孟春行夏令，则风雨不时，草木早槁，国乃有恐。行秋令，则民大疫，疾风暴雨数至，藜莠蓬蒿并兴。行冬令，则水潦为败，霜雪大挚，首种不入。</p>   <h2 class="sectionHeading"><a id="ebookNote_3"></a>本生</h2>   <p class="bodyReference">二曰——</p>   <p class="bodyContent">始生之者，天也；养成之者，人也。能养天之所生而勿撄之谓天子。天子之动也，以全天为故者也。此官之所自立也。立官者以全生也。今世之感主，多官而反以害生，则失所为立之矣。臂之若修兵者，以备寇也，分修兵而反以自攻，则亦失所为修之矣。</p>   <p class="bodyContent">夫水之性情，土者鴽之，故不得清。人之性寿，物者鴽之，故不得寿。物也者，所以养性也，非（所）以性养也。今世之人，惑者多以性养物，则不知轻重也。不知轻重，则重者为轻，轻者为重矣。若此，则每动无不败，以此为君悖，以此为臣乱，以此为子狂。三者国有一焉，无幸必亡。</p>   <p class="bodyContent">今有声于此，耳听之必慊，已听之则使人聋，必弗听。有色于此，目视之必慊，已视之则使人盲，必弗视。有味于此，口食之必慊，已食之则使人瘩，必弗食。是教圣人之子声色滋味也，利于性则取之，害于性则舍之，此全性之道也。世之贵富者，其子声色滋味也多惑者，日夜求，幸而得之则遁焉。遁焉，性�= "bodyContent">万人操弓共射一招，招无不中。万物章章，以害一生，生无不伤；以便一生，生无不长。故圣人之制万物也，以全其天也。天全则神和矣，目明矣，耳听矣，鼻臭矣，口敏矣，三百六十节皆通利矣。若此人者，不言而信，不谋而当，不虑而得；精通乎天地，神覆乎宇宙；其于物无不受也，无不裹也，若天地然；上为天子而不骄，下为匹夫而不惛；此之谓全德之人。</p>   <p class="bodyContent">贵富而不知道，适足以为患，不如贫贱。贫贱之致物也难，虽欲过之奚由？出则以车，入则以辇，务以自佚，命之曰招鴽之机。肥肉厚酒，务以自强，命之日烂肠之食。靡曼皓齿，郑、卫之音，务以自乐，命之日伐性之斧。三患者，贵富之所致也。故古之人有不肯富者矣，由重生故也，非夸以名也，为其实也。则此论之不可不察也。</p>   <h2 class="sectionHeading"><a id="ebookNote_4"></a>重已</h2>   <p class="bodyReference">三曰——</p>   <p class="bodyContent">倕，至巧也。人不爱倕之指，而爱己之指，有之利故也。人不爱昆山之玉，江汉之珠，而爱己一苍壁小玑，有之利故也。今吾生之为我有，而利我亦大矣。论其贵贱，爵为天子，不足以比焉；论其轻重，富有天下，不可以易之；论其安危，一曙失之，终身不复得。此三者，有道者之所慎也。有慎之而反害之者，不达乎性命之情也。不达平性命之情，慎之何益？是师者之爱子也。不免乎枕之以糠；是聋者之养婴儿也，方雷而窥之于堂；有殊弗知慎者。夫弗知慎者，是死生存亡可不可，未始有别也。未始有别者，其所谓是未尝是，其所谓非未尝非，是其所谓非，非其所谓是，此之谓大惑。若此人者，天之所祸也。以此治身，必死必殃；以此治国，必残必亡。夫死殃残亡，非自至也，感召之也。寿长至常亦然。故有道者，不察所召，而察其召之者，则其至不可禁矣。此论不可不熟。</p>   <p class="bodyContent">使乌获疾引牛尾，尾绝力殚，而牛不可行， 逆也。 使五尺竖子引其棬，而牛恣所以之，顺也。世之人主贵人，无贤不肖，莫不欲长生久视，而目逆其生，欲之何益？凡生之长也，顺之也；使生不顾者，欲也；教圣人必先适欲。</p>   <p class="bodyContent">室大则多阴，台高则多阳，多阴则蹶，多阳则痿，此阴阳不适之患也。是故先王不处大室，不为高台，味不众珍，衣不燀热。燀热则理塞，理塞则气不达；味众珍则胃充，胃充则中大鞔；中大鞔而气不达，以此长生，可得乎？昔先圣王之为苑囿国池也，足以观望劳形而已矣；其为宫室台榭也，足以辟燥湿而已矣；其为奥马衣裘也，足以逸身暖骸而已矣；其为饮食酏醴也，足以适味充虚而已矣；其为声色音乐也，足以实性自娱而已矣。五者，圣王之所以养性也，非好俭而恶费也，节乎性也。</p>   <h2 class="sectionHeading"><a id="ebookNote_5"></a>贵公</h2>   <p class="bodyReference">四曰——</p>   <p class="bodyContent">昔先圣王之治天下也，必先公，公则天下平矣。平得于公。尝试观于上志，有得天下者众矣，其得之〔必〕以公，其失之必以偏。（凡主之立生于公）故《鸿范 》曰：“无偏无党， 王道荡荡；无偏无颇，遵王之义；无或作好，遵王之道；无或作恶，遵王之路 。”</p>   <p class="bodyContent">天下非一人之天下也，天下之天下也。阴阳之和，不长一类；甘露时雨，不私一物；万民之主，不阿一人。伯禽将行，请所以治鲁，周公日：“利而勿利也 。”刑人有遗弓者， 而不肯索，曰：“荆人遗之，荆人得之，又何索焉？” 孔子闻之曰：“去其‘荆’而可矣 。�大官也。 处大官者， 不欲小察， 不欲小智， 放曰： 大匠不鴽， 大庖不豆， 大勇不斗， 大兵不寇。 桓公行公去私恶， 用管子而为五伯长， 行私阿所爱， 用竖刀而虫出于户。 < /p>   <p class="bodyContent">人之少也愚，其长也智，故智而用私，不若愚而用公。日醉而饰服，私利而立公，贪戾而求王，舜弗能为。</p > < h2 class = "sectionHeading"><a id="ebookNote_6"></a>去私</h2>   <p class="bodyReference">五曰——</p>   <p class="bodyContent">天无私覆也，地无私载也，日月无私烛也，四时无私行也，行其德而万物得遂长焉。</p>   <p class="bodyContent">黄帝言目 ：‘声禁重，色禁重，农禁重，香禁重，味禁重，室禁重 。”</p>   <p class="bodyContent">“尧有子十八，不与其子而授舜，舜有子九人，不与其子而授禹，至公也。</p>   <p class="bodyContent">晋平公问于祁黄羊口 ：‘南阳无令，其谁可而为之？”祁黄羊对曰；“解狐可 。”平公曰 ：‘解狐非子之仇邪？”对曰：“君问可，非问臣之仇也 。”平公曰：“善 。”遂用之。 国人称善焉。居有间， 平公又问祁黄羊口 ：‘国无尉， 其谁可而为之？”对日 ：‘午可 。”平公曰 ：‘午非子之子邪？”对曰：‘君问可，非问臣之子也 。”平公曰：“善 。”又遂用之。 国人称善焉。孔子闻之曰：“善哉！祁黄羊之论也，外举不避仇，内举不避子 。”祁黄羊可谓公矣。</p>   <p class="bodyContent">墨者有巨子腹[黄享]，居秦，其子杀人， 秦惠王曰：“先生之年长矣，非有它子也，寡人已令吏弗诛矣，先生之以此听寡人也 。”腹[黄享]对曰；‘墨者之法日 ：‘杀人者死， 伤人者刑’，此所以禁杀伤人也。夫禁杀伤人者， 天下之大义也，王虽为之赐，而令吏弗诛，腹[黄享]不可不行墨者之法 。”不许惠王，而遂杀之。子，人之所私也，忍所私以行大义，巨子可谓公矣。</p>   <p class="bodyContent">庖人调和而弗敢食，故可以为庖。若使底子调和而食之，则不可以为疱矣。王伯之君亦然，诛暴而不私，以封天下之贤者，故可以为王伯；若使王伯之君诛暴而私之，则亦不可为王伯矣。</p>    </html>
         * img : https://bookcases.oss-cn-beijing.aliyuncs.com/6a35c613bb6cba0df788edd90c88ed19/css/Stylesheet.css
         */

        private String next;
        private String current;
        private String css;

        public String getNext() {
            return next;
        }

        public void setNext(String next) {
            this.next = next;
        }

        public String getCurrent() {
            return current;
        }

        public void setCurrent(String current) {
            this.current = current;
        }

        public String getCss() {
            return css;
        }

        public void setCss(String css) {
            this.css = css;
        }
    }
}
